In [1]:
import pandas as pd

In [4]:
#Creating a dataframe
df1=pd.DataFrame({
    "city":["delhi","chennai","mumbai"],
    "temperature":[30,35,40]
})
df1

      city  temperature
0    delhi           30
1  chennai           35
2   mumbai           40

In [6]:
#Creating another dataframe
df2=pd.DataFrame({
    "city":["chennai","mumbai","delhi"],
    "humidity":[78,70,68]
})
df2

      city  humidity
0  chennai        78
1   mumbai        70
2    delhi        68

In [7]:
#merging the 2 dataframes
df3=pd.merge(df1,df2,on="city")
df3
#Note: Here we have same set of cities..

      city  temperature  humidity
0    delhi           30        68
1  chennai           35        78
2   mumbai           40        70

In [8]:
#merging the tables with different cities in the 2 tables
df1=pd.DataFrame({
    "city":["delhi","chennai","mumbai","kochi"],
    "temperature":[30,35,40,50]
})
df1

      city  temperature
0    delhi           30
1  chennai           35
2   mumbai           40
3    kochi           50

In [9]:
df2=pd.DataFrame({
    "city":["chennai","mumbai","hydrabad"],
    "humidity":[78,70,68]
})
df2

       city  humidity
0   chennai        78
1    mumbai        70
2  hydrabad        68

In [10]:
#Merging here we could notivce that inner join operation is performes
df3=pd.merge(df1,df2,on="city")
df3

      city  temperature  humidity
0  chennai           35        78
1   mumbai           40        70

In [11]:
#To merge all the contents of both the tables, use outer join
df3=pd.merge(df1,df2,on="city",how="outer")
df3

       city  temperature  humidity
0     delhi         30.0       NaN
1   chennai         35.0      78.0
2    mumbai         40.0      70.0
3     kochi         50.0       NaN
4  hydrabad          NaN      68.0

In [14]:
#For left join
df3=pd.merge(df1,df2,on="city",how="left")
df3

      city  temperature  humidity
0    delhi           30       NaN
1  chennai           35      78.0
2   mumbai           40      70.0
3    kochi           50       NaN

In [15]:
#For right join
df3=pd.merge(df1,df2,on="city",how="right")
df3

       city  temperature  humidity
0   chennai         35.0        78
1    mumbai         40.0        70
2  hydrabad          NaN        68

In [16]:
#To know from which dataframe, the elements are coming, use indicator method
df3=pd.merge(df1,df2,on="city",how="left",indicator=True)
df3

      city  temperature  humidity     _merge
0    delhi           30       NaN  left_only
1  chennai           35      78.0       both
2   mumbai           40      70.0       both
3    kochi           50       NaN  left_only

In [18]:
#Suffices:
df1=pd.DataFrame({
    "city":["delhi","chennai","mumbai","kochi"],
    "temperature":[30,35,40,28],
    "humidity":[78,70,68,75]
})
df1

      city  temperature  humidity
0    delhi           30        78
1  chennai           35        70
2   mumbai           40        68
3    kochi           28        75

In [19]:
df2=pd.DataFrame({
    "city":["chennai","mumbai","hydrabad"],
    "temperature":[30,35,40],
    "humidity":[78,70,68]
})
df2

       city  temperature  humidity
0   chennai           30        78
1    mumbai           35        70
2  hydrabad           40        68

In [20]:
df3=pd.merge(df1,df2,on="city")
df3

      city  temperature_x  humidity_x  temperature_y  humidity_y
0  chennai             35          70             30          78
1   mumbai             40          68             35          70

in the above table, both the temperature and humidity is present in both the dataframes.. Hence to differentiate that, we can use suffices...

In [22]:
df3=pd.merge(df1,df2,on='city',suffixes=("_left","_right"))
df3

      city  temperature_left  humidity_left  temperature_right  humidity_right
0  chennai                35             70                 30              78
1   mumbai                40             68                 35              70